title: IFEO injection using Global Flags
id: 7622f89c-b147-4214-9484-32e0b9464f7b
status: stable
description: Detects the Image File Exection Options (IFEO) injection usign the Global Flags to persist
references:
  - https://www.jaiminton.com/Mitreatt&ck/T1546-012
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1546.012
  - https://www.youtube.com/watch?v=-hz0PTVa0k4
author: Juanma
date: 2025-10-27
tags:
    - attack.persistence
    - attack.t1546.012
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
   - Image|endswith: '\reg.exe'
   - OriginalFilename: 'reg.exe'
  selection_cmd:
    - CommandLine|contains:
         - '/v GlobalFlag /t REG_DWORD /d 512'
         - '/v ReportingMode /t REG_DWORD /d 1'
         - '/v MonitorProcess /d'
         - 'REG ADD "HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Image File Execution Options\'
         - 'REG ADD "HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\SilentProcessExit\'
  filter:
    CommandLine|contains:
      - 'C:\Windows\system32\reg.exe query hklm\software\microsoft\windows\softwareinventorylogging /v collectionstate /reg:64'
  condition: all of selection and not filter
falsepositives:
  - This could be a legit activity from an admin
level: medium