title: SIGMA - Detect PS command encoded execution
id: 88c20d01-c051-4f0c-926a-9e53b50c5d24
status: test
description: # Try to follow the flow of "What are we detecting, how is it used, why is it (bad|interesting|noteworthy)"
references:
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1059.001
  - Atomic Test 15 - ATHPowerShellCommandLineParameter -EncodedCommand parameter variations
author: juanma
date: 2025-10-19
tags:
    - attack.execution
    - attack.t1059.001
logsource:
  category: powershell # Ensure your logsource matches your intended data source
  product: windows
detection:
  selection_img: # You can use any name for these variables and it may benefit you to use descriptive terms in your rules.
   - Image|endswith:
         - '\powershell.exe'
  selection_filename:
   - OriginalFilename:
         - 'powershell.exe'
  selection_cmd:
   - CommandLine|contains:
         - '-e'
         - '-encodedcommand'
         - '-enc'
         - '-enco'
         - '-en'
  condition: all of selection_*
falsepositives:
  - This could be a legit activity from an admin
level: medium
