title: Cached Credential Dump via Cmdkey
id: bacbe85a-4fd6-46a3-a06c-c3ca489f40a7
status: test
description: Detects esentutl.exe dumping credentials from Google Chrome.
author: Juanma
references:
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1003.005
  - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/cmdkey
date: 2025-11-09
tags:
    - attack.t1555.003
    - attack.credential-access
    - attack.s0404
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\cmdkey.exe'
        CommandLine|contains:
            - '/list'
    condition: selection_img
falsepositives:
  - None
level: medium