title: WinPwn - UAC Bypass ccmstp technique
id: abbb217a-2f2d-466b-ab81-24c9d790d2f2
status: test
description: Detects UAC bypass using ccmstp technique via function of WinPwn.
author: Juanma
references:
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1548.002
  - https://attack.mitre.org/techniques/T1548/002/
  - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks
date: 2025-11-09
tags:
    - attack.t1548.002
    - attack.defense-evasion
    - attack.privilege-escalation
logsource:
    category: process_creation
    product: windows
detection:
    selection_powershell:
        Image|endswith: '\powershell.exe'
        CommandLine|contains:
            - 'iex'
            - 'downloadstring'
    selection_ccmstp:
        CommandLine|contains|all:
            - 'UACBypass'
            - 'noninteractive'
            - 'command'
            - 'technique'
            - 'ccmstp'
    condition: selection_powershell and selection_ccmstp
falsepositives:
  - None
level: medium