title: Copy and execute file with PsExec
id: dd5f5dab-3ec1-4e44-bf86-0bd7f74f9192
status: test
description: Detrects when a file is copied to a remote host using the PsExec Windows tool.
author: Juanma
references:
  - https://attack.mitre.org/techniques/T1021/002/
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1021.002
  - https://www.hackingarticles.in/lateral-movement-remote-services-mitret1021/
date: 2025-11-10
tags:
  - attack.t1021.002
  - attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
   #OriginalFilenaName: 'psexec.c' # process.pe.original_file_name / process.name
   Image|endswith: '\PsExec.exe' # process.executable
  selection_cmd:
   CommandLine|contains:
       - '-accepteula'
       - '-c'
  condition: all of selection_*
falsepositives:
  - Administrators can use this tool for elevated taks. Validate with admin activity
level: medium