title: Domain Controller Discovery via Nltest
id: b88df5e5-b58d-4bb4-a91c-9d1f4934c9c1
status: test
description: Detects the use of the Windows command-line utility Nltest to discover domain controllers and enumerate trusts.
author: Juanma
references:
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1482
  - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731935(v=ws.11)
  - https://attack.mitre.org/software/S0359/
date: 2025-11-08
tags:
  - attack.t1482
  - attack.discovery
  - attack.s0359
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: '\nltest.exe' # process.executable
    OriginalFileName: 'nltestrk.exe' # process.pe.original_file_name
    ParentImage|endswith: '\cmd.exe' # process.parent.executable
  selection_cmd:
    CommandLine|contains:
      - '/domain_trusts'
      - '/trusted_domains'
  condition: all of selection_*
falsepositives:
  - Administrators or power users may use this command for troubleshooting
level: medium
