title: Create Account- Domain Account - Username itadm
id: 96430ca6-96ef-4e79-b749-bf436e4e1fc0
status: test
description: Detecys when a user is created and added to the domain using the net.exe file.
author: Juanma
references:
  - https://attack.mitre.org/techniques/T1136/002/
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1136.002
  - https://viperone.gitbook.io/pentest-everything/everything/everything-active-directory/persistence/create-account/domain-account
date: 2025-11-10
tags:
  - attack.t1136.002
  - attack.persistence
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
   ParentImage|endswith: '\net.exe' # process.parent.executable
   OriginalFilenaName: 'net1.exe' # process.pe.original_file_name / process.name
   Image|endswith: '\net1.exe' # process.executable
  selection_cmd:
   CommandLine|contains|all:
       - 'user itadm'
       - '/add'
       - '/domain'
  condition: all of selection_*
falsepositives:
  - Administrators can use this tool for elevated taks. Validate with admin activity
level: medium
# Review final command when converted to Lucene