title: AnyDesk COnfiguration Files Detected on Endpoint
id: 9543a568-1ae4-48d4-b112-3af1070a3774
status: test
description: Detectes the AnyuDesk's configuration files created after its installation.
author: Juanma
references:
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1219
  - https://attack.mitre.org/techniques/T1219
date: 2025-11-10
tags:
    - attack.t1219
    - attack.command-and-control
logsource:
    category: file_event
    product: windows
detection:
    selection:
      Image|endswith: '\AnyDesk.exe'
      TargetFileName: # file.name
        - 'system.conf'
        - 'user.conf'
    condition: selection
falsepositives:
  - Unknown
level: medium
