title: Remote Access Software - AnyDesk Files Detected Test on Windows
id: 5a810720-d389-4e65-a616-4194d90a5f70
status: test
description: Detects when a threat actor attempts to download AnyDesk using PowerShell Invoke-WenRequest
author: Juanma
references:
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1219
  - https://attack.mitre.org/techniques/T1219
date: 2025-11-11
tags:
    - attack.t1562.004
    - attack.defense-evasion
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
      Image|endswith: '\powershell.exe'
      CommandLine|contains|all:
        - 'Invoke-WebRequest'
        - 'download.anydesk.com/AnyDesk.exe'
    condition: selection_img
falsepositives:
  - None
level: medium
