title: Data compression with Winrar
id: e359269f-66ca-49c6-8280-daf802fe83b1
status: test
description: Detects data compression previous to exfiltration
author: Juanma
references:
  - https://attack.mitre.org/techniques/T1560.001
  - https://attack.mitre.org/software/S0190/
date: 2025-11-11
tags:
    - attack.t1560.001
    - attack.collection
logsource:
    category: process_creation
    product: windows
detection:
    selection:
      Image|endswith: '\cmd.exe'
      CommandLine|contains|all:
          - 'Rar.exe'
          - 'a'
          - '-r'
    condition: selection
falsepositives:
    - Unknown
level: medium