title: Winrar Downloaded via BITSadmin
id: 414f4916-6db7-4a15-8b36-227069357bd5
status: test
description: Winrar being downloaded by BITSadmin
author: Juanma
references:
  - https://attack.mitre.org/techniques/T1197
  - https://attack.mitre.org/techniques/T1048
  - https://attack.mitre.org/techniques/T1105
  - https://attack.mitre.org/software/S0190/
date: 2025-11-11
tags:
    - attack.t1197
    - attack.collection
logsource:
    category: process_creation
    product: windows
detection:
    selection:
      Image|endswith: '\bitsadmin.exe'
      CommandLine|contains:
        - 'transfer'
        - 'download'
        - 'winrar'
    condition: selection
falsepositives:
  - None
level: medium