# Check the final query
title: Akira Ransomnote
id: 2a647bee-20b6-4bd1-b11b-4932a18781cc
status: test #, test, experimental, deprecated, unsupported
description: Detects the creation of files with extension .akira and the ransom note after the files encyption
author: Juanma
references:
  - https://attack.mitre.org/techniques/T1486/
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1486
  - https://raw.githubusercontent.com/skandler/simulate-akira/main/akira_readme.txt
date: 2025-11-11
tags:
    - attack.t1486
    - attack.impact
logsource:
    category: file_event
    product: windows
detection:
    selection_note:
        TargetFileName: 'akira_readme.txt' # file.name
    selection_extension:
        TargetFileName|contains: '.akira'
    condition: selection_note or selection_extension
falsepositives:
    - Unknown
level: medium