title: Basic Permission Groups Discovery Windows (Domain)
id: 196989a4-2b53-4acb-a02a-f3cdc9976eaa
status: stable
description: Detects basic permissions groups discovery by the use of net group command with the purpose to identify domain groups.
author: Juanma
references:
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1069.002
  - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc725622(v=ws.11)
  - https://attack.mitre.org/techniques/T1069/002/
date: 2025-11-08
tags:
  - attack.t1069.002
  - attack.discovery
  - attack.s0039
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith:
      - '\net.exe' # process.executable
      - '\net1.exe'
    OriginalFileName:
      -  'net.exe' # process.pe.original_file_name
      -  'net1.exe'
    ParentImage|endswith:
      - '\cmd.exe' # process.parent.executable
      - '\net.xe'
  selection_cmd:
    CommandLine|contains:
      - 'group'
      - '/domain'
      - 'enterprise admins'
      - 'domain admins'
  filter:
    CommandLine|contains:
      - '/add'
      - 'user'
  condition: all of selection_* and not filter
falsepositives:
  - Administrators or power users may use this command for troubleshooting
level: medium
