title: Remote System Discovery with nltest
id: 7d2f1c51-5487-4f45-9c76-e6f1a848861c
status: test
description: Detects when Nltest.exe will run against a target domain to retrive a list of domain controllers
author: Juanma
references:
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1018
  - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731935(v=ws.11)
  - https://attack.mitre.org/techniques/T1018/
date: 2025-11-08
tags:
  - attack.t1018
  - attack.discovery
  - attack.s0359
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: '\nltest.exe' # process.executable
    OriginalFileName: 'nltestrk.exe' # process.pe.original_file_name
    ParentImage|endswith: '\cmd.exe' # process.parent.executable
  selection_cmd:
    CommandLine|contains:
      - '/dclist'
      - '/dsgetdc'
  condition: all of selection_*
falsepositives:
  - Administrators or power users may use this command for troubleshooting
level: medium
