title: Domain Trust Discovery
id: 38271019-b20b-4590-b550-b816ce1da0e4
status: test
description: Thrat actor can run AdFind.exe to gather information from AD. This rule when a threat actor uses AdFind to enumerate the OUs and Domain trust relationships.
author: Juanma
references:
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1482
  - https://attack.mitre.org/software/S0552/
  - https://attack.mitre.org/techniques/T1482/
  - https://thedfirreport.com/2020/05/08/adfind-recon/
date: 2025-11-08
tags:
  - attack.t1482
  - attack.discovery
  - attack.s0552
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: '\AdFind.exe' # process.executable
    OriginalFileName: 'AdFind.exe' # process.pe.original_file_name
    ParentImage|endswith: '\cmd.exe' # process.parent.executable
  selection_cmd_ou:
    CommandLine|contains:
      - '-f' # doing the LDAP filter
      - '(objectcategory=organizationalUnit)' # filtering by OUs
  selection_cmd_trust:
    CommandLine|contains: # enumerates all domain and forest trust relationships
      - '-gcb'
      - '-sc'
      - 'trustdump'
  condition: selection_img and (selection_cmd_ou or selection_cmd_trust)
falsepositives:
  - Administrators or power users may use this command for troubleshooting
level: medium