title: Network Service Discovery (advanced ip scanner)
id: c44d7edf-d03e-44b9-be24-4a62889b0c1a
status: test
description: Advance IP Scanner software is used to scan the network.
author: Juanma
references:
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1046
  - https://download.advanced-ip-scanner.com/download/files/Advanced_IP_Scanner_2.5.4594.1.exe
  - https://attack.mitre.org/techniques/T1046/
date: 2025-11-08
tags:
  - attack.t1046
  - attack.discovery
  - attack.s0057
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: '\cmd.exe' # process.executable
    OriginalFileName: 'Cmd.Exe' # process.pe.original_file_name
  selection_cmd:
    CommandLine|contains:
      - 'advanced_ip_scanner_console.exe'
      - '/r:' # provide the ip range
  condition: all of selection_*
falsepositives:
  - Administrators or power users may use this command for troubleshooting
level: medium