title: Offline Credential Theft With Mimikatz
id: fa6617bc-6345-4d9f-9cc1-f54c20cb2720
status: test
description: Detects the execution of mimikats to dump local credentials from lssas.exe.
author: Juanma
references:
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1003.001
  - https://attack.mitre.org/techniques/T1003/
  - https://www.elastic.co/blog/elastic-security-detecting-credential-dumping
date: 2025-11-08
tags:
  - attack.t1003.001
  - attack.credential-access
  - attack.s0002
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: '\cmd.exe' # process.executable
    OriginalFileName: 'Cmd.Exe' # process.pe.original_file_name
  selection_cmd:
    CommandLine|contains:
      - 'sekurlsa::minidump '
      - 'sekurlsa::logonpasswords'
  condition: all of selection_*
falsepositives:
  - None
level: medium