title: Detectes Run Key Persistance
id: f35a2849-1f48-49e7-b353-271ec89c7d07
status: test
description: Detects when a subkey contains a program stored on a startup entries and will run automatically when the user logs in.
references:
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1547.001
  - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/reg-add
author: Juanma
date: 2025-10-27
tags:
  - attack.t1547.001
  - attack.persistence
logsource:
  category: regitry_event
  product: windows
detection:
  selection_registry_path:
    TargetObject|contains: '\Microsoft\Windows\CurrentVersion\Run'
  selection_value_name:
    RegistryValueName: 'Atomic Red Team'
  selection_value_type:
    RegistruValueType: 'REG_SZ'
  selection_value_data:
    RegistryValueData|endswith: '.exe'
  condition: all of selection_*
level: high