# This is a lab sigma rule
title: Lab1 - LOLBAS - Inappropriate use of Remote.exe
id: 9cc72918-209b-4099-a206-2d4ce8fca09a
status: experimental
description: Detects the inappropriate use of remote.exe for spawning suspicious processes.
references:
    - https://mrd0x.com/Exeuction-AWL-Bypass-Remote-exe-LOLBin/
author: Juanmadelg
date: 2024-10-05
tags:
    - attack.defense_evasion
logsource:
    category: process_creation
    product: windows
detection:
    bin:
        Image|endswith: 'remote.exe'
    cmdline_input:
        CommandLine|contains:
            - '/s'
    cmdline_bin:
        CommandLine|contains:
            - 'powershell.exe'
            - 'powershell.exe -c'
            - 'cmd.exe'
            - 'cmd.exe /c'
    condition: bin and cmdline_input and cmdline_bin
falsepositives:
    - Legitimate administrative or user activity
level: medium