title: Dump LSASS.exe Memory using ProcDump
id: b23373d6-5f66-4f64-be2c-dd8f52cbe35a
status: test
description: Detects ProcDump.exe dumping LSASS process memory, which is often used for credential theft.
author: Juanma
references:
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1003.001
  - https://attack.mitre.org/techniques/T1003/
  - https://learn.microsoft.com/en-us/sysinternals/downloads/procdump
date: 2025-11-09
tags:
  - attack.t1003.001
  - attack.credential-access
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: '\procdump64.exe' # process.executable
    OriginalFileName: 'procdump' # process.pe.original_file_name
  selection_cmd:
    CommandLine|contains:
      - '-ma'
      - 'lsass.exe'
  condition: all of selection_*
falsepositives:
  - None
level: medium