title: Dump Credentials using Lazagne
id: 761a10f1-9a00-49cd-b7c1-a4873e271115
status: test
description: Detects LaZagne dumping credentials from browsers.
author: Juanma
references:
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1003.001
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1555.003
  - https://github.com/AlessandroZ/LaZagne
  - https://attack.mitre.org/software/S0349/
date: 2025-11-08
tags:
  - attack.t1003.001
  - attack.credential-access
  - attack.s0349
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: '\LaZagne.exe' # process.executable
    ParentImage|endswith: '\cmd.exe' # process.parent.executable
  selection_cmd:
    CommandLine|contains:
      - 'browsers'
  condition: all of selection_*
falsepositives:
  - None
level: medium