title: Dump Credentials using esentutl.exe from Chrome
id: 0ae8ee07-7250-4f2d-a05d-0f5622d268ed
status: test
description: Detects esentutl.exe dumping credentials from Google Chrome.
author: Juanma
references:
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1555.003
  - https://attack.mitre.org/software/S0404/
  - https://ss64.com/nt/esentutl.html
  - https://softwaredocs.weatherford.com/cygnet/95/content/topics/Database%20Utilities/ESENTUTL%20Utility.htm
  - https://dfironthemountain.wordpress.com/tag/dfir/
date: 2025-11-09
tags:
  - attack.t1555.003
  - attack.credential-access
  - attack.s0404
logsource:
  category: process_creation
  product: windows
detection:
  selection_cmd:
    CommandLine|contains|all:
      - 'esentutl'
      - '/y'
      - '/d'
  condition: selection_cmd
falsepositives:
  - None
level: medium