title: Rubeus kerberoast
id: 1a1ca799-517a-48a2-946c-93a819afd7f5
status: test
description: Detects the action of clear the kerberos tickets (klist) and the execution of Rubeus kerberoasting.
author: Juanma
references:
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1558.003
  - https://attack.mitre.org/techniques/T1558/003/
  - https://github.com/GhostPack/Rubeus?tab=readme-ov-file#kerberoast
  - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/klist
date: 2025-11-09
tags:
    - attack.t1558.003
    - attack.credential-access
logsource:
    category: process_creation
    product: windows
detection:
    selection_klist: # clear all Kerberos tickets from the current session
        Image|endswith: '\klist.exe'
        CommandLine|contains: 'purge'
    selection_rubeus: # Kerberoasting all users in the current domain
        Image|endswith: 'rubeus.exe'
        CommandLine|contains: 'kerberoast'
    condition: selection_klist or selection_rubeus
falsepositives:
  - None
level: medium