title: SeDebugPrivilege token duplication
id: ac376f58-d8a4-4bed-abf9-95fd004d1e46
status: test
description: Uses PowerShell and Empire's GetSystem module. The script uses SeDebugPrivilege to obtain, duplicate and impersonate the token of a another process.
author: Juanma
references:
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1134.001
  - https://attack.mitre.org/techniques/T1134/001/
  - https://github.com/BC-SECURITY/Empire/blob/v3.4.0/data/module_source/privesc/Get-System.ps1

date: 2025-11-09
tags:
    - attack.t1134.001
    - attack.defense-evasion
    - attack.privilege-escalation
logsource:
    category: process_creation
    product: windows
detection:
    selection_powershell:
        Image|endswith: '\powershell.exe'
        CommandLine|contains:
            - 'IEX'
            - 'IWR'
            - 'UseBasicParsing'
    selection_getsystem:
        CommandLine|contains|all:
            - 'Get-System'
            - 'Technique'
            - 'Token'
    condition: selection_powershell and selection_getsystem
falsepositives:
  - None
level: medium