title: Create Account - Domain Account - Powershell
id: 058219e1-8e0b-4abc-807a-4046ee988b4f
status: test
description: Uses PowerShell and Empire's GetSystem module. The script uses SeDebugPrivilege to obtain, duplicate and impersonate the token of a another process.
author: Juanma
references:
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1136.002
  - https://attack.mitre.org/techniques/T1136/002/
  - https://www.codeproject.com/articles/Using-System-DirectoryServices-AccountManagement#comments-section
date: 2025-11-10
tags:
    - attack.t1136.002
    - attack.persistence
logsource:
    category: process_creation
    product: windows
detection:
    selection_powershell:
        Image|endswith: '\powershell.exe'
        CommandLine|contains:
            - 'System.DirectoryServices.AccountManagement' # provides a high-level API for managing security principals (users, groups, computers) on AD
    condition: selection_powershell
falsepositives:
  - None
level: medium