title: Impair Defenses - Disable Defender
id: b786ef58-87d1-4b31-80f7-9e6ed203c78b
status: test
description: Detects the attempt to disable Windpws Defender using three techniques. Via PowerShell, Registry modification, and DISM
author: Juanma
references:
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1562.001
  - https://attack.mitre.org/techniques/T1562/001/
date: 2025-11-10
tags:
    - attack.t1562.001
    - attack.defense-evasion
logsource:
    category: process_creation
    product: windows
detection:
    selection_img_ps:
        Image|endswith: '\powershell.exe'
    selection_img_dism:
        Image|endswith: '\Dism.exe'
    selection_wd_ps:
        CommandLine|contains: 'Set-MpPreference'
    selection_wd_reg:
        CommandLine|contains|all:
            - '\Policies\Microsoft\Windows Defender\'
            - 'DisableAntiSpyware'
    selection_wd_dism:
        CommandLine|contains|all:
            - 'Disable-Feature'
            - 'FeatureName:Windows-Defender'
            - '/Remove'
            - '/NoRestart'
            - '/quiet'
    condition: (selection_img_ps and (selection_wd_ps or selection_wd_reg)) or (selection_img_dism and selection_wd_dism)
falsepositives:
  - None
level: medium