title: Disable Microsoft Defender Firewall via Registry
id: 4dffcf8f-a5ea-416c-b19a-9396e26a6348
status: test
description: Detects the attempt to disable Windpws Defender modifying the regisrty key
author: Juanma
references:
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1562.004
  - https://attack.mitre.org/techniques/T1562/004/
date: 2025-11-10
tags:
    - attack.t1562.004
    - attack.defense-evasion
logsource:
    category: process_creation
    product: windows
detection:
    selection:
      Image|endswith: '\reg.exe'
      CommandLine|contains|all:
        - 'EnableFirewall'
        - '/d 0'
    condition: selection
falsepositives:
  - None
level: medium
