title: Ngrok Proxy Service
id: b880916c-5890-4704-b5e7-617935f80053
status: test
description: Detects the connection attemopts to Ngrok proxy
author: Juanma
references:
  - https://attack.mitre.org/techniques/T1090/
  - https://attack.mitre.org/software/S0508/
date: 2025-11-10
tags:
    - attack.t1090.001
    - attack.t1090.002
    - attack.t1090.003
    - attack.t1090.004
    - attack.command-and-control
logsource:
    category: process_creation
    product: windows
detection:
    selection: # testing connectivity
      Image|endswith: '\PING.EXE'
      CommandLine|contains:
        - 'ngrok'
    condition: selection
falsepositives:
  - None
level: medium
