title: Data compression with pass using Winrar
id: ed04ad87-5113-4b37-83e7-85e02ae0a106
status: test
description: Detects data compressed and encrypted using Winrar previous to exfiltration
author: Juanma
references:
  - https://attack.mitre.org/techniques/T1560.001
  - https://attack.mitre.org/software/S0190/
date: 2025-11-11
tags:
    - attack.t1560.001
    - attack.collection
logsource:
    category: process_creation
    product: windows
detection:
    selection:
      Image|endswith: '\cmd.exe'
      CommandLine|contains|all:
          - 'Rar.exe'
          - 'a -hp'
    condition: selection
falsepositives:
    - Unknown
level: medium