title: Exfiltration via FTP - Rclone
id: 3c15c7ca-f211-404d-804e-54381b86ae90
status: test #, test, experimental, deprecated, unsupported
description: Detects exfiltration over alternative protocol such as FTP using Rclone. A previous rule detects the configuration. 
author: Juanma
references:
  - https://attack.mitre.org/techniques/T1048.003
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1048.003
  - https://rclone.org/commands/
  - https://rclone.org/ftp/
date: 2025-11-11
tags:
    - attack.t1048.003
    - attack.exfiltration
logsource:
    category: process_creation
    product: windows
detection:
    selection:
      Image|endswith: '\rclone.exe'
      CommandLine|contains|all:
          - 'copy'
          - 'ftpserver'
          - 'bwlimit'
          - '--ftp-no-check-certificate'
    condition: selection
falsepositives:
    - Unknown
level: medium