title: Exfiltration with Rclone to Cloud Storage
id: 8053e022-7f06-4486-bb0b-1ac766bb8eec
status: test #, test, experimental, deprecated, unsupported
description: Detects exfiltration with Rclone to Cloud Storage - Mega
author: Juanma
references:
  - https://attack.mitre.org/techniques/T1567.002
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1567.002
  - https://attack.mitre.org/software/S1040/
date: 2025-11-11
tags:
    - attack.t1567.002
    - attack.exfiltration
    - attack.s1040
logsource:
    category: process_creation
    product: windows
detection:
    selection:
      Image|endswith: '\rclone.exe'
      CommandLine|contains|all:
          - 'config create'
          - 'mega'
    condition: selection
falsepositives:
    - Unknown
level: medium