title: Delete Shadow copies
id: 9dbac353-7c9b-4a3c-b5f6-556556b4d00f
status: test #, test, experimental, deprecated, unsupported
description: Threat actors can delete or remove built-in data and turn off services designed to aid in the recovery of a corrupted system to prevent recovery.
author: Juanma
references:
  - https://attack.mitre.org/techniques/T1490/
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1490
  - https://raw.githubusercontent.com/skandler/simulate-akira/main/akira_readme.txt
date: 2025-11-11
tags:
    - attack.t1486
    - attack.impact
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\powershell.exe'
        CommandLine|contains|all:
            - 'Get-WmiObject'
            - 'Shadowcopy'
            - 'Delete'
    condition: selection
falsepositives:
    - Unknown
level: medium