title: Process Discovey with tasklist
id: d2a9ea64-a2d0-43ed-bd4e-9653e469d9b8
status: test
description: Detects attempt to get information about running processes on a system. Adversaries may use the information from Process Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.
author: Juanma
references:
  - https://www.atomicredteam.io/atomic-red-team/atomics/T1057
  - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/tasklist
  - https://attack.mitre.org/techniques/T1057/
date: 2025-11-08
tags:
  - attack.t1057
  - attack.discovery
  - attack.s0057
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: '\tasklist.exe' # process.executable
    OriginalFileName: 'tasklist.exe' # process.pe.original_file_name
    ParentImage|endswith: '\cmd.exe' # process.parent.executable
  selection_cmd:
    CommandLine|contains: # this line is no needed. No additional parameters are passed
      - 'tasklist'
  condition: all of selection_*
falsepositives:
  - Administrators or power users may use this command for troubleshooting
level: medium
